### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [2]:
# Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)

In [3]:
purchase_data

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,101,Final Critic,4.19
779,779,Ennrian78,24,Male,50,Dawn,4.60

## Player Count

* Display the total number of players

In [4]:
player_attributes = purchase_data.loc[:, ["Gender", "SN", "Age"]]
player_attributes

     Gender             SN  Age
0      Male        Lisim78   20
1      Male    Lisovynya38   40
2      Male     Ithergue48   24
3      Male  Chamassasya86   24
4      Male      Iskosia90   23
..      ...            ...  ...
775  Female     Aethedru70   21
776    Male         Iral74   21
777    Male     Yathecal72   20
778    Male        Sisur91    7
779    Male      Ennrian78   24

[780 rows x 3 columns]

In [5]:
player_attributes = player_attributes.drop_duplicates()
player_attributes

     Gender             SN  Age
0      Male        Lisim78   20
1      Male    Lisovynya38   40
2      Male     Ithergue48   24
3      Male  Chamassasya86   24
4      Male      Iskosia90   23
..      ...            ...  ...
773    Male         Hala31   21
774    Male     Jiskjask80   11
775  Female     Aethedru70   21
777    Male     Yathecal72   20
778    Male        Sisur91    7

[576 rows x 3 columns]

In [6]:
numPlayers = player_attributes.count()
numPlayers

Gender    576
SN        576
Age       576
dtype: int64

In [7]:
numPlayers = player_attributes.count()[0]
numPlayers

576

In [9]:
playersDF = pd.DataFrame({"Total Players" : [numPlayers]})
playersDF

   Total Players
0            576

## Purchasing Analysis (Total)

In [10]:
uniqueItems = purchase_data["Item ID"].unique()
len(uniqueItems)

183

In [13]:
averagePrice = purchase_data["Price"].mean()
averagePrice

3.050987179487176

In [16]:
numberofPurchases = purchase_data["Item ID"].count()
numberofPurchases

780

In [18]:
totalRevenue = purchase_data["Price"].sum()
totalRevenue

2379.77

In [23]:
purchaseDF = pd.DataFrame({"Number of Unique Items": [len(uniqueItems)], 
                          "Average Price": [averagePrice],
                          "Number of Purchases": [numberofPurchases],
                          "Total Revenue": [totalRevenue]})
purchaseDF["Average Price"] = purchaseDF["Average Price"].map("${:,.2f}".format)
purchaseDF["Total Revenue"] = purchaseDF["Total Revenue"].map("${:,.2f}".format)
purchaseDF

   Number of Unique Items Average Price  Number of Purchases Total Revenue
0                     183         $3.05                  780     $2,379.77

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [24]:
players = player_attributes["Gender"].value_counts()
players

Male                     484
Female                    81
Other / Non-Disclosed     11
Name: Gender, dtype: int64

In [29]:
percentages = (players/numPlayers) * 100.00
percentages

Male                     84.027778
Female                   14.062500
Other / Non-Disclosed     1.909722
Name: Gender, dtype: float64

In [32]:
genderDemographics = pd.DataFrame({"Total Count":players,
                                  "Percentage of Players": percentages})
genderDemographics["Percentage of Players"] = genderDemographics["Percentage of Players"].map("{:,.2f}%".format)
genderDemographics

                       Total Count Percentage of Players
Male                           484                84.03%
Female                          81                14.06%
Other / Non-Disclosed           11                 1.91%


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [35]:
genderPurchaseCounts = purchase_data.groupby(["Gender"]).count()["Price"].rename("Purchase Count")
genderPurchaseCounts

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: Purchase Count, dtype: int64

In [38]:
genderPurchaseAverage = purchase_data.groupby(["Gender"]).mean()["Price"].rename("Average Purchase Price")
genderPurchaseAverage

Gender
Female                   3.203009
Male                     3.017853
Other / Non-Disclosed    3.346000
Name: Average Purchase Price, dtype: float64

In [43]:
totalPurchaseValue = purchase_data.groupby(["Gender"]).sum()["Price"].rename("Total Purchase Value")
totalPurchaseValue

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Total Purchase Value, dtype: float64

In [48]:
perPerson = totalPurchaseValue / genderDemographics["Total Count"]
perPerson

Female                   4.468395
Male                     4.065372
Other / Non-Disclosed    4.562727
dtype: float64

In [50]:
purchaseAnalysisGenderDF = pd.DataFrame({"Purchase Count": genderPurchaseCounts,
                                        "Average Purchase Price": genderPurchaseAverage,
                                        "Total Purchase Value": totalPurchaseValue,
                                        "Avg Total Per Person": perPerson})

purchaseAnalysisGenderDF["Average Purchase Price"] = purchaseAnalysisGenderDF["Average Purchase Price"].map("${:,.2f}".format)
purchaseAnalysisGenderDF["Total Purchase Value"] = purchaseAnalysisGenderDF["Total Purchase Value"].map("${:,.2f}".format)
purchaseAnalysisGenderDF["Avg Total Per Person"] = purchaseAnalysisGenderDF["Avg Total Per Person"].map("${:,.2f}".format)

purchaseAnalysisGenderDF

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Per Person
Gender,,,,
Female,113,$3.20,$361.94,$4.47
Male,652,$3.02,"$1,967.64",$4.07
Other / Non-Disclosed,15,$3.35,$50.19,$4.56

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [57]:
age_bins = [0, 9.9, 14.9, 19.9, 24.9, 29.9, 34.9, 39.9, 100]
group_names = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

player_attributes ["Age Ranges"] = pd.cut(player_attributes["Age"], age_bins, labels=group_names)

ageTotals = player_attributes["Age Ranges"].value_counts()

agePercents = (ageTotals/ numPlayers) *100

ageInfoDF= pd.DataFrame({"Total Count": ageTotals,
                        "Percentage of Players": agePercents})

ageInfoDF["Percentage of Players"] = ageInfoDF["Percentage of Players"].map("{:,.2f}%".format)

ageInfoDF= ageInfoDF.sort_index()


ageInfoDF

C:\Users\shaqu\Anaconda3\lib\site-packages\ipykernel_launcher.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  after removing the cwd from sys.path.

       Total Count Percentage of Players
<10             17                 2.95%
10-14           22                 3.82%
15-19          107                18.58%
20-24          258                44.79%
25-29           77                13.37%
30-34           52                 9.03%
35-39           31                 5.38%
40+             12                 2.08%

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [62]:
purchase_data ["Age Ranges"] = pd.cut (purchase_data["Age"], age_bins, labels= group_names)

purchaseCounts = purchase_data.groupby(["Age Ranges"]).count()["Price"].rename("Purchase Count")
avgPurchasePrice = purchase_data.groupby(["Age Ranges"]).mean()["Price"].rename("Average Purchase Price")
totalPurchaseValue = purchase_data.groupby(["Age Ranges"]).sum()["Price"].rename("Total Purchase Value")

perPerson = totalPurchaseValue / ageInfoDF["Total Count"]

ageDataDF= pd.DataFrame({"Purchase Count": purchaseCounts,
                        "Average Purchase Price":avgPurchasePrice,
                        "Total Purchase Value": totalPurchaseValue,
                        "Average Purchase Per Person": perPerson})

ageDataDF["Average Purchase Price"] = ageDataDF["Average Purchase Price"].map("${:,.2f}".format)
ageDataDF["Total Purchase Value"] = ageDataDF["Total Purchase Value"].map("${:,.2f}".format)
ageDataDF["Average Purchase Per Person"] = ageDataDF["Average Purchase Per Person"].map("${:,.2f}".format)

ageDataDF= ageDataDF.sort_index()


ageDataDF

,Purchase Count,Average Purchase Price,Total Purchase Value,Average Purchase Per Person
Age Ranges,,,,
<10,23,$3.35,$77.13,$4.54
10-14,28,$2.96,$82.78,$3.76
15-19,136,$3.04,$412.89,$3.86
20-24,365,$3.05,"$1,114.06",$4.32
25-29,101,$2.90,$293.00,$3.81
30-34,73,$2.93,$214.00,$4.12
35-39,41,$3.60,$147.67,$4.76
40+,13,$2.94,$38.24,$3.19

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [80]:
purchaseCount = purchase_data.groupby(["SN"]).count()["Price"].rename("Purchase Count")
avgPurchase = purchase_data.groupby(["SN"]).mean()["Price"].rename("Average Purchase Price")
totalPurchase = purchase_data.groupby(["SN"]).sum()["Price"].rename("Total Purchase Value")
spendersDF = pd.DataFrame({"Purchase Count":purchaseCount,
                          "Average Purchase Price":avgPurchase,
                          "Total Purchase Value":totalPurchase})
spendersDF["Average Purchase Price"] = spendersDF["Average Purchase Price"].map("${:,.2f}".format)
spendersDF["Total Purchase Value"] = spendersDF["Total Purchase Value"].map("${:,.2f}".format)
spendersDFSorted = spendersDF.sort_values("Total Purchase Value", ascending=False)
spendersDFSorted = spendersDFSorted.loc[:,["Purchase Count", "Average Purchase Price", "Total Purchase Value"]]
spendersDFSorted.head(5)

              Purchase Count Average Purchase Price Total Purchase Value
SN
Haillyrgue51               3                  $3.17                $9.50
Phistym51                  2                  $4.75                $9.50
Lamil79                    2                  $4.64                $9.29
Aina42                     3                  $3.07                $9.22
Saesrideu94                2                  $4.59                $9.18

             Purchase Count Average Purchase Price Total Purchase Value
SN
Lisosia93                 5                  $3.79               $18.96
Idastidru52               4                  $3.86               $15.45
Chamjask73                3                  $4.61               $13.83
Iral74                    4                  $3.40               $13.62
Iskadarya95               3                  $4.37               $13.10

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [89]:
items = purchase_data.loc[:,["Item ID", "Item Name", "Price"]]
itemCount = items.groupby(["Item ID", "Item Name"]).count()["Price"].rename("Purchase Count")
itemPrice = items.groupby(["Item ID", "Item Name"]).mean()["Price"]
itemTotal = items.groupby(["Item ID", "Item Name"]).sum()["Price"].rename("Total Purchase Value")

popularItemDF = pd.DataFrame({"Purchase Count":itemCount,
                             "Item Price":itemPrice,
                             "Total Purchase Value":itemTotal})

popularItemDF["Item Price"] = popularItemDF["Item Price"].map("${:,.2f}".format)
popularItemDF["Total Purchase Value"] = popularItemDF["Total Purchase Value"].map("${:,.2f}".format)
popularItemDFSorted = popularItemDF.sort_values("Purchase Count", ascending=False)

popularItemDFSorted.head()

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
145,Fiery Glass Crusader,9,$4.58,$41.22
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77
82,Nirvana,9,$4.90,$44.10
19,"Pursuit, Cudgel of Necromancy",8,$1.02,$8.16

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
145,Fiery Glass Crusader,9,$4.58,$41.22
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77
82,Nirvana,9,$4.90,$44.10
19,"Pursuit, Cudgel of Necromancy",8,$1.02,$8.16

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

In [90]:
popularItemDFSortedAgain = popularItemDF.sort_values("Total Purchase Value", ascending=False)

popularItemDFSortedAgain.head()

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
63,Stormfury Mace,2,$4.99,$9.98
29,"Chaos, Ender of the End",5,$1.98,$9.90
173,Stormfury Longsword,2,$4.93,$9.86
1,Crucifer,3,$3.26,$9.78
38,"The Void, Vengeance of Dark Magic",4,$2.37,$9.48

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
82,Nirvana,9,$4.90,$44.10
145,Fiery Glass Crusader,9,$4.58,$41.22
92,Final Critic,8,$4.88,$39.04
103,Singed Scalpel,8,$4.35,$34.80